run/simpleBattery/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
location    "system";
object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     lmbFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2.0;

deltaT          0.001;

writeControl    adjustableRunTime;
writeInterval   0.01;			// Changed this to 0.1 from 0.01 - breaks

// writeControl timeStep;
// writeInterval 20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;

maxAlphaCo      0.8;

maxDeltaT       0.01;

libs ( "libfieldFunctionObjects.so" );

functions
(
/*	friction
	{
	   patches	   (leftWall rightWall lowerWall defaultFaces atmosphere);
	   CofR		   (0.098 0 0);
	   writeControl	   timeStep;
	   writeInterval    1;
	   // Field names
	   p		   p;
	   U		   U;
	   rho		   rhoInf;
	   rhoInf	   8900;

	   type		   forces;
	   log 		   true;
	}
	*/
    minMaxPd
    {
        type minMaxField;
	name pd;
    }
    /*
    minMaxU
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name U;
    }
    minMaxAlpha1
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name alpha1;
    }
    minMaxK
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name k;
    }
    minMaxNuT
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name nut;
    }
*/
);


// ************************************************************************* //
